#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
<pre>terraform
module.thadmin_hosting.aws_s3_bucket.this: Refreshing state... [id=thalia-thadmin-staging]
module.thadmin_routing.module.cloudfront.aws_cloudfront_origin_access_identity.this["s3_bucket"]: Refreshing state... [id=E3JOC36ODMBL65]
module.thadmin_routing.module.acm.aws_acm_certificate.this: Refreshing state... [id=arn:aws:acm:us-east-1:627002765486:certificate/565d3a00-d047-48f2-956a-aed08dd6956b]
module.thadmin_routing.module.acm.aws_route53_record.validation["thadmin-staging.technicie.nl"]: Refreshing state... [id=Z3I4ZHBBD5NSHU__f4c1968cf0da5157d0f46ed63ecf426e.thadmin-staging.technicie.nl._CNAME]
module.thadmin_routing.module.acm.aws_acm_certificate_validation.this: Refreshing state... [id=2022-03-15 04:55:50.004 +0000 UTC]
module.thadmin_hosting.aws_s3_bucket_acl.this: Refreshing state... [id=thalia-thadmin-staging,private]
module.thadmin_hosting.aws_s3_bucket_cors_configuration.this: Refreshing state... [id=thalia-thadmin-staging]
module.thadmin_routing.module.cloudfront.aws_cloudfront_distribution.this[0]: Refreshing state... [id=E2ZP8HCBLISQFN]
module.thadmin_routing.aws_s3_bucket_policy.bucket_policy: Refreshing state... [id=thalia-thadmin-staging]
module.thadmin_routing.aws_route53_record.api: Refreshing state... [id=Z3I4ZHBBD5NSHU_thadmin-staging_A]
module.thadmin_hosting.aws_s3_object.code_build_object["mstile-70x70.png"]: Refreshing state... [id=mstile-70x70.png]
module.thadmin_hosting.aws_s3_object.code_build_object["mstile-150x150.png"]: Refreshing state... [id=mstile-150x150.png]
module.thadmin_hosting.aws_s3_object.code_build_object["apple-splash-2388-1668.jpg"]: Refreshing state... [id=apple-splash-2388-1668.jpg]
module.thadmin_hosting.aws_s3_object.code_build_object["apple-splash-1668-2224.jpg"]: Refreshing state... [id=apple-splash-1668-2224.jpg]
module.thadmin_hosting.aws_s3_object.code_build_object["apple-splash-640-1136.jpg"]: Refreshing state... [id=apple-splash-640-1136.jpg]
module.thadmin_hosting.aws_s3_object.code_build_object["apple-splash-2048-2732.jpg"]: Refreshing state... [id=apple-splash-2048-2732.jpg]
module.thadmin_hosting.aws_s3_object.code_build_object["apple-splash-2732-2048.jpg"]: Refreshing state... [id=apple-splash-2732-2048.jpg]
module.thadmin_hosting.aws_s3_object.code_build_object["favicon.ico"]: Refreshing state... [id=favicon.ico]
module.thadmin_hosting.aws_s3_object.code_build_object["js/973.326f857c.js"]: Refreshing state... [id=js/973.326f857c.js]
module.thadmin_hosting.aws_s3_object.code_build_object["apple-splash-2208-1242.jpg"]: Refreshing state... [id=apple-splash-2208-1242.jpg]
module.thadmin_hosting.aws_s3_object.code_build_object["apple-splash-2688-1242.jpg"]: Refreshing state... [id=apple-splash-2688-1242.jpg]
module.thadmin_hosting.aws_s3_object.code_build_object["mstile-144x144.png"]: Refreshing state... [id=mstile-144x144.png]
module.thadmin_hosting.aws_s3_object.code_build_object["apple-splash-2778-1284.jpg"]: Refreshing state... [id=apple-splash-2778-1284.jpg]
module.thadmin_hosting.aws_s3_object.code_build_object["site.webmanifest"]: Refreshing state... [id=site.webmanifest]
module.thadmin_hosting.aws_s3_object.code_build_object["mstile-310x310.png"]: Refreshing state... [id=mstile-310x310.png]
module.thadmin_hosting.aws_s3_object.code_build_object["apple-splash-1136-640.jpg"]: Refreshing state... [id=apple-splash-1136-640.jpg]
module.thadmin_hosting.aws_s3_object.code_build_object["mstile-310x150.png"]: Refreshing state... [id=mstile-310x150.png]
module.thadmin_hosting.aws_s3_object.code_build_object["js/app.aa2f1319.js.map"]: Refreshing state... [id=js/app.aa2f1319.js.map]
module.thadmin_hosting.aws_s3_object.code_build_object["favicon-32x32.png"]: Refreshing state... [id=favicon-32x32.png]
module.thadmin_hosting.aws_s3_object.code_build_object["apple-splash-1620-2160.jpg"]: Refreshing state... [id=apple-splash-1620-2160.jpg]
module.thadmin_hosting.aws_s3_object.code_build_object["js/chunk-vendors.fad575e6.js.map"]: Refreshing state... [id=js/chunk-vendors.fad575e6.js.map]
module.thadmin_hosting.aws_s3_object.code_build_object["js/app.aa2f1319.js"]: Refreshing state... [id=js/app.aa2f1319.js]
module.thadmin_hosting.aws_s3_object.code_build_object["apple-splash-2532-1170.jpg"]: Refreshing state... [id=apple-splash-2532-1170.jpg]
module.thadmin_hosting.aws_s3_object.code_build_object["js/973.326f857c.js.map"]: Refreshing state... [id=js/973.326f857c.js.map]
module.thadmin_hosting.aws_s3_object.code_build_object["apple-splash-1170-2532.jpg"]: Refreshing state... [id=apple-splash-1170-2532.jpg]
module.thadmin_hosting.aws_s3_object.code_build_object["apple-splash-2224-1668.jpg"]: Refreshing state... [id=apple-splash-2224-1668.jpg]
module.thadmin_hosting.aws_s3_object.code_build_object["img/anonymousUser.c7a94bce.jpg"]: Refreshing state... [id=img/anonymousUser.c7a94bce.jpg]
module.thadmin_hosting.aws_s3_object.code_build_object["browserconfig.xml"]: Refreshing state... [id=browserconfig.xml]
module.thadmin_hosting.aws_s3_object.code_build_object["apple-splash-1125-2436.jpg"]: Refreshing state... [id=apple-splash-1125-2436.jpg]
module.thadmin_hosting.aws_s3_object.code_build_object["css/app.5b725460.css"]: Refreshing state... [id=css/app.5b725460.css]
module.thadmin_hosting.aws_s3_object.code_build_object["js/chunk-vendors.fad575e6.js"]: Refreshing state... [id=js/chunk-vendors.fad575e6.js]
module.thadmin_hosting.aws_s3_object.code_build_object["apple-splash-1792-828.jpg"]: Refreshing state... [id=apple-splash-1792-828.jpg]
module.thadmin_hosting.aws_s3_object.code_build_object["apple-splash-750-1334.jpg"]: Refreshing state... [id=apple-splash-750-1334.jpg]
module.thadmin_hosting.aws_s3_object.code_build_object["apple-touch-icon.png"]: Refreshing state... [id=apple-touch-icon.png]
module.thadmin_hosting.aws_s3_object.code_build_object["safari-pinned-tab.svg"]: Refreshing state... [id=safari-pinned-tab.svg]
module.thadmin_hosting.aws_s3_object.code_build_object["favicon.png"]: Refreshing state... [id=favicon.png]
module.thadmin_hosting.aws_s3_object.code_build_object["apple-splash-2048-1536.jpg"]: Refreshing state... [id=apple-splash-2048-1536.jpg]
module.thadmin_hosting.aws_s3_object.code_build_object["apple-splash-2160-1620.jpg"]: Refreshing state... [id=apple-splash-2160-1620.jpg]
module.thadmin_hosting.aws_s3_object.code_build_object["apple-splash-1242-2208.jpg"]: Refreshing state... [id=apple-splash-1242-2208.jpg]
module.thadmin_hosting.aws_s3_object.code_build_object["apple-splash-1284-2778.jpg"]: Refreshing state... [id=apple-splash-1284-2778.jpg]
module.thadmin_hosting.aws_s3_object.code_build_object["apple-splash-2436-1125.jpg"]: Refreshing state... [id=apple-splash-2436-1125.jpg]
module.thadmin_hosting.aws_s3_object.code_build_object["apple-splash-1334-750.jpg"]: Refreshing state... [id=apple-splash-1334-750.jpg]
module.thadmin_hosting.aws_s3_object.code_build_object["android-chrome-192x192.png"]: Refreshing state... [id=android-chrome-192x192.png]
module.thadmin_hosting.aws_s3_object.code_build_object["apple-splash-1536-2048.jpg"]: Refreshing state... [id=apple-splash-1536-2048.jpg]
module.thadmin_hosting.aws_s3_object.code_build_object["apple-splash-1668-2388.jpg"]: Refreshing state... [id=apple-splash-1668-2388.jpg]
module.thadmin_hosting.aws_s3_object.code_build_object["android-chrome-512x512.png"]: Refreshing state... [id=android-chrome-512x512.png]
module.thadmin_hosting.aws_s3_object.code_build_object["img/backgroundImage.24f22a44.jpg"]: Refreshing state... [id=img/backgroundImage.24f22a44.jpg]
module.thadmin_hosting.aws_s3_object.code_build_object["apple-splash-1242-2688.jpg"]: Refreshing state... [id=apple-splash-1242-2688.jpg]
module.thadmin_hosting.aws_s3_object.code_build_object["favicon-16x16.png"]: Refreshing state... [id=favicon-16x16.png]
module.thadmin_hosting.aws_s3_object.code_build_object["apple-splash-828-1792.jpg"]: Refreshing state... [id=apple-splash-828-1792.jpg]
module.thadmin_hosting.aws_s3_object.code_build_object["index.html"]: Refreshing state... [id=index.html]
module.thadmin_hosting.aws_s3_object.code_build_object["favicon.svg"]: Refreshing state... [id=favicon.svg]
module.thadmin_hosting.aws_s3_object.code_build_object["css/chunk-vendors.3b0641a8.css"]: Refreshing state... [id=css/chunk-vendors.3b0641a8.css]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # module.thadmin_hosting.aws_s3_object.code_build_object["css/chunk-vendors.3b0641a8.css"] will be destroyed
  - resource "aws_s3_object" "code_build_object" {
      - bucket                 = "thalia-thadmin-staging" -> null
      - bucket_key_enabled     = false -> null
      - content_type           = "text/css" -> null
      - etag                   = "6dd286cff6ca6bb14353ce8f4625f5b9" -> null
      - force_destroy          = false -> null
      - id                     = "css/chunk-vendors.3b0641a8.css" -> null
      - key                    = "css/chunk-vendors.3b0641a8.css" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "/home/runner/work/thadmin/thadmin/infra/modules/hosting/../../..//dist/css/chunk-vendors.3b0641a8.css" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null
    }

  # module.thadmin_hosting.aws_s3_object.code_build_object["css/chunk-vendors.69841cd7.css"] will be created
  + resource "aws_s3_object" "code_build_object" {
      + bucket                 = "thalia-thadmin-staging"
      + bucket_key_enabled     = (known after apply)
      + content_type           = "text/css"
      + etag                   = "530efe1002118ee78851f32f8dfcc2f4"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "css/chunk-vendors.69841cd7.css"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "/home/runner/work/thadmin/thadmin/infra/modules/hosting/../../..//dist/css/chunk-vendors.69841cd7.css"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.thadmin_hosting.aws_s3_object.code_build_object["img/backgroundImage.24f22a44.jpg"] will be updated in-place
  ~ resource "aws_s3_object" "code_build_object" {
      ~ etag                   = "407e69540c950ce3e893be2cbadd0f30-2" -> "5f59aad8b5eddf226c7e5a21939e4018"
        id                     = "img/backgroundImage.24f22a44.jpg"
        tags                   = {}
      + version_id             = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.thadmin_hosting.aws_s3_object.code_build_object["index.html"] will be updated in-place
  ~ resource "aws_s3_object" "code_build_object" {
      ~ etag                   = "91f45fb9843e63273b9ff38ae49f3b0c" -> "818c8b0636deaedd8f8ff6435d1d2c09"
        id                     = "index.html"
        tags                   = {}
      + version_id             = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.thadmin_hosting.aws_s3_object.code_build_object["js/973.326f857c.js"] will be destroyed
  - resource "aws_s3_object" "code_build_object" {
      - bucket                 = "thalia-thadmin-staging" -> null
      - bucket_key_enabled     = false -> null
      - content_type           = "text/javascript" -> null
      - etag                   = "883ba4e7f7add2dd3814ccd9d0c175cc" -> null
      - force_destroy          = false -> null
      - id                     = "js/973.326f857c.js" -> null
      - key                    = "js/973.326f857c.js" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "/home/runner/work/thadmin/thadmin/infra/modules/hosting/../../..//dist/js/973.326f857c.js" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null
    }

  # module.thadmin_hosting.aws_s3_object.code_build_object["js/973.326f857c.js.map"] will be destroyed
  - resource "aws_s3_object" "code_build_object" {
      - bucket                 = "thalia-thadmin-staging" -> null
      - bucket_key_enabled     = false -> null
      - content_type           = "application/octet-stream" -> null
      - etag                   = "2e2e9386c31529129d258de882435108" -> null
      - force_destroy          = false -> null
      - id                     = "js/973.326f857c.js.map" -> null
      - key                    = "js/973.326f857c.js.map" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "/home/runner/work/thadmin/thadmin/infra/modules/hosting/../../..//dist/js/973.326f857c.js.map" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null
    }

  # module.thadmin_hosting.aws_s3_object.code_build_object["js/973.d084d2fe.js"] will be created
  + resource "aws_s3_object" "code_build_object" {
      + bucket                 = "thalia-thadmin-staging"
      + bucket_key_enabled     = (known after apply)
      + content_type           = "text/javascript"
      + etag                   = "d3318ae49d840e7936f90b585e6e14c2"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "js/973.d084d2fe.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "/home/runner/work/thadmin/thadmin/infra/modules/hosting/../../..//dist/js/973.d084d2fe.js"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.thadmin_hosting.aws_s3_object.code_build_object["js/973.d084d2fe.js.map"] will be created
  + resource "aws_s3_object" "code_build_object" {
      + bucket                 = "thalia-thadmin-staging"
      + bucket_key_enabled     = (known after apply)
      + content_type           = "application/octet-stream"
      + etag                   = "3e8cc54b53bf4b0c91f81447986f76d7"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "js/973.d084d2fe.js.map"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "/home/runner/work/thadmin/thadmin/infra/modules/hosting/../../..//dist/js/973.d084d2fe.js.map"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.thadmin_hosting.aws_s3_object.code_build_object["js/app.aa2f1319.js"] will be destroyed
  - resource "aws_s3_object" "code_build_object" {
      - bucket                 = "thalia-thadmin-staging" -> null
      - bucket_key_enabled     = false -> null
      - content_type           = "text/javascript" -> null
      - etag                   = "620faee4c6cafbfeaa9d026d75c83163" -> null
      - force_destroy          = false -> null
      - id                     = "js/app.aa2f1319.js" -> null
      - key                    = "js/app.aa2f1319.js" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "/home/runner/work/thadmin/thadmin/infra/modules/hosting/../../..//dist/js/app.aa2f1319.js" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null
    }

  # module.thadmin_hosting.aws_s3_object.code_build_object["js/app.aa2f1319.js.map"] will be destroyed
  - resource "aws_s3_object" "code_build_object" {
      - bucket                 = "thalia-thadmin-staging" -> null
      - bucket_key_enabled     = false -> null
      - content_type           = "application/octet-stream" -> null
      - etag                   = "1eb02da5e4243b15431f2bea4c8f73e2" -> null
      - force_destroy          = false -> null
      - id                     = "js/app.aa2f1319.js.map" -> null
      - key                    = "js/app.aa2f1319.js.map" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "/home/runner/work/thadmin/thadmin/infra/modules/hosting/../../..//dist/js/app.aa2f1319.js.map" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null
    }

  # module.thadmin_hosting.aws_s3_object.code_build_object["js/app.debec4ce.js"] will be created
  + resource "aws_s3_object" "code_build_object" {
      + bucket                 = "thalia-thadmin-staging"
      + bucket_key_enabled     = (known after apply)
      + content_type           = "text/javascript"
      + etag                   = "2be23daafcca9fcd1ecd063290c0f0d5"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "js/app.debec4ce.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "/home/runner/work/thadmin/thadmin/infra/modules/hosting/../../..//dist/js/app.debec4ce.js"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.thadmin_hosting.aws_s3_object.code_build_object["js/app.debec4ce.js.map"] will be created
  + resource "aws_s3_object" "code_build_object" {
      + bucket                 = "thalia-thadmin-staging"
      + bucket_key_enabled     = (known after apply)
      + content_type           = "application/octet-stream"
      + etag                   = "40e8d9a7229df72eab406f233d22aba0"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "js/app.debec4ce.js.map"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "/home/runner/work/thadmin/thadmin/infra/modules/hosting/../../..//dist/js/app.debec4ce.js.map"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.thadmin_hosting.aws_s3_object.code_build_object["js/chunk-vendors.30c84ee2.js"] will be created
  + resource "aws_s3_object" "code_build_object" {
      + bucket                 = "thalia-thadmin-staging"
      + bucket_key_enabled     = (known after apply)
      + content_type           = "text/javascript"
      + etag                   = "81966c56d8be93719323faa56cd4fc77"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "js/chunk-vendors.30c84ee2.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "/home/runner/work/thadmin/thadmin/infra/modules/hosting/../../..//dist/js/chunk-vendors.30c84ee2.js"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.thadmin_hosting.aws_s3_object.code_build_object["js/chunk-vendors.30c84ee2.js.map"] will be created
  + resource "aws_s3_object" "code_build_object" {
      + bucket                 = "thalia-thadmin-staging"
      + bucket_key_enabled     = (known after apply)
      + content_type           = "application/octet-stream"
      + etag                   = "50fdde84117cff9e3d7d3e65238be0e9"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "js/chunk-vendors.30c84ee2.js.map"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "/home/runner/work/thadmin/thadmin/infra/modules/hosting/../../..//dist/js/chunk-vendors.30c84ee2.js.map"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.thadmin_hosting.aws_s3_object.code_build_object["js/chunk-vendors.fad575e6.js"] will be destroyed
  - resource "aws_s3_object" "code_build_object" {
      - bucket                 = "thalia-thadmin-staging" -> null
      - bucket_key_enabled     = false -> null
      - content_type           = "text/javascript" -> null
      - etag                   = "daef38026a02fee354d5aadb4a48edcb" -> null
      - force_destroy          = false -> null
      - id                     = "js/chunk-vendors.fad575e6.js" -> null
      - key                    = "js/chunk-vendors.fad575e6.js" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "/home/runner/work/thadmin/thadmin/infra/modules/hosting/../../..//dist/js/chunk-vendors.fad575e6.js" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null
    }

  # module.thadmin_hosting.aws_s3_object.code_build_object["js/chunk-vendors.fad575e6.js.map"] will be destroyed
  - resource "aws_s3_object" "code_build_object" {
      - bucket                 = "thalia-thadmin-staging" -> null
      - bucket_key_enabled     = false -> null
      - content_type           = "application/octet-stream" -> null
      - etag                   = "eca30dfd8a007cce95d8ab97e5f01ed5" -> null
      - force_destroy          = false -> null
      - id                     = "js/chunk-vendors.fad575e6.js.map" -> null
      - key                    = "js/chunk-vendors.fad575e6.js.map" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "/home/runner/work/thadmin/thadmin/infra/modules/hosting/../../..//dist/js/chunk-vendors.fad575e6.js.map" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null
    }

Plan: 7 to add, 2 to change, 7 to destroy.

Warning: Value for undeclared variable

The root module does not declare a variable named "aws_profile" but a value
was found in file "terraform.tfvars". To use this value, add a "variable"
block to the configuration.

Using a variables file to set an undeclared variable is deprecated and will
become an error in a future release. If you wish to provide certain "global"
settings to all configurations in your organization, use TF_VAR_...
environment variables to set these instead.


------------------------------------------------------------------------

Note: You didn't specify an "-out" parameter to save this plan, so Terraform
can't guarantee that exactly these actions will be performed if
"terraform apply" is subsequently run.

</pre>
</details>